Revit 2024 API
LightGroupManager.SetLightGroupOn Method
 Turns the given light group on or off for rendering the given view depending on the bool argument
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetLightGroupOn(
	ElementId viewId,
	ElementId groupId,
	bool turnOn
)
Visual Basic
Public Sub SetLightGroupOn ( _
	viewId As ElementId, _
	groupId As ElementId, _
	turnOn As Boolean _
)
Visual C++
public:
void SetLightGroupOn(
	ElementId^ viewId,
	ElementId^ groupId,
	bool turnOn
)
Parameters
viewId
Type: Autodesk.Revit.DB.ElementId
 The Id of the view
groupId
Type: Autodesk.Revit.DB.ElementId
 The Id of the light group
turnOn
Type: System.Boolean
 Turns the light group on if true, off if false
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light group
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace